const digital = [
  {
    name: "لوازم جانبی گوشی",
    children: ["پایه نگهدارنده گوشی", "کیف و کاور گوشی", "پاور بانک"],
  },
  {
    name: "گوشی موبایل",
    children: ["آنر", "هواوی", "سامسونگ", "اپل", "شیایومی", "نوکیا"],
  },
  {
    name: "واقعیت مجازی",
  },
  {
    name: "مچ بند و ساعت هوشمند",
  },
  {
    name: "هدفون , هدست و هندزفری",
  },
  {
    name: "اسپیکر بلوتوث و با سیم",
  },
  {
    name: "هارد و فلش و  SSD",
  },
  {
    name: "دوربین",
    children: [
      "دوربین عکاسی دیجیتال",
      "دوربین ورزشی و فیلم برداری",
      "دوربین چاپ سریع",
    ],
  },
  {
    name: "لوازم جانبی دوربین",
    children: ["لنز", "کیف", "کارت حافظه", "کاغذ چاپ عکس"],
  },
  {
    name: "دوربین دو چشمی و شکاری",
  },
  {
    name: "تلسکوپ",
  },
  {
    name: "پلی استیشن، ایکس باکس و بازی",
  },
  {
    name: "کامپیوتر و تجهیزات جانبی",
    children: [
      "تجهیزات مخصوص بازی",
      "مانیتور",
      "کیس های اسمبل شده",
      "قطعات داخلی کامپیوتر",
      "موس",
      "کیبورد",
    ],
  },
  {
    name: "لپتاپ",
  },
  {
    name: "لوازم جانبی لپ تاپ",
    children: ["کیف کوله و کاور", "کابل‌ صدا، AUX و HDMI"],
  },
  {
    name: "تبلت",
  },
  {
    name: "شارژر تبلت و موبایل",
  },
  {
    name: "کیف، کاور، لوازم جانبی تبلت",
  },
  {
    name: "باتری",
  },
  {
    name: "دوربین‌های تحت شبکه",
  },
];

export { digital };
